<?php

namespace Database\Seeders;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;

use App\Models\Comment;
use App\Models\Nutrient;
use App\Models\Product;
use App\Models\User;
use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     */
    public function run(): void
    {
        // \App\Models\User::factory(10)->create();

        // \App\Models\User::factory()->create([
        //     'name' => 'Test User',
        //     'email' => 'test@example.com',
        // ]);

        ////////////////////////
        
        $cats = [
            [
                "name" => "خشکبار",
                "image" => "/images/products/driet_fruit1.webp"
            ],
            [
                "name" => "حبوبات",
                "image" => "/images/products/beans2.webp"
            ],
            [
                "name" => "آجیل",
                "image" => "/images/products/beans2.webp"
            ],
            [
                "name" => "لبنیات محلی",
                "image" => "/images/products/beans2.webp"
            ],
            [
                "name" => "گیاهان دارویی",
                "image" => "/images/products/beans2.webp"
            ],
            [
                "name" => "عسل",
                "image" => "/images/products/honey1.webp"
            ],
            [
                "name" => "ترشیجات",
                "image" => "/images/products/beans2.webp"
            ],
            [
                "name" => "کمپوت",
                "image" => "/images/products/beans2.webp"
            ],
            [
                "name" => "مربا",
                "image" => "/images/products/beans2.webp"
            ],
            [
                "name" => "شیره/آب میوه",
                "image" => "/images/products/beans2.webp"
            ],
            [
                "name" => "سرکه",
                "image" => "/images/products/beans2.webp"
            ],
            [
                "name" => "لواشک",
                "image" => "/images/products/beans2.webp"
            ],
            [
                "name" => "میوه ها",
                "image" => "/images/products/beans2.webp"
            ],
        ];
                
        foreach($cats as $cat) {
        
                    \App\Models\Category::create($cat);
        }

        

        // $nutrients = [
        //     [
        //         'name' => 'ویتامین A',
        //         'description' => 'ویتامین A (رتینول) برای دیدن در شب لازم است. ,ویتامین A با ایجاد سلولهای ایمنی و حفظ مانع فیزیکی در برابر عوامل بیماری زا با پر کردن سلولهای پوستی و روده ای، به دفاع ایمنی شما کمک می کند. ویتامین A یک ماده مغذی محلول در چربی است که یک نوع آنتی اکسیدان است، به این معنی که از سلولهای شما در برابر آسیب رادیکالهای آزاد اکسیژن محافظت می کند، که هنگام متابولیسم اکسیژن توسط سلولها ایجاد می شود.ویتامین A در تعیین نوع بافتی که هر یک از سلولهای شما دارد، نقش دارد.بنابراین از اهمیت ویژه ای در طی رشد جنین برخوردار است. ویتامین A به اشکال مختلف از منابع گیاهی و حیوانی یافت می شود. ویتامین A از منابع حیوانی برای بدن آماده استفاده است. ویتامین A از منابع گیاهی (مانند بتاکاروتن) فقط در صورت نیاز بدن به ویتامین A فعال متابولیزه می شود. برای ترکیب تمام منابع، ویتامین A اغلب در RAE (معادل فعالیت رتینول) گزارش می شود.'
        //     ],
        //     [
        //         'name' => 'ویتامین E',
        //         'description' => 'ویتامین E با نام آلفا توکوفرول مهمترین آنتی اکسیدان محلول در چربی است که به محافظت از سلولها و بافتها در برابر آسیب رادیکالهای آزاد اکسیژن که در هنگام متابولیسم اکسیژن سلولها ایجاد می شود، کمک می کند.'
        //     ],
        //     [
        //         'name' => 'ویتامین C',
        //         'description' => 'ویتامین C که اسید آسکوربیک نیز نامیده می شود، یک آنتی اکسیدان است که به محافظت از بافتها در برابر استرس اکسیداتیو کمک می کند.در ساخت کلاژن نقش دارد و به پوست، استخوانها و غضروف ها ساختار می دهد.ویتامین C در هنگام هضم از آهن در برابر اکسیداسیون محافظت می کند، و باعث سهولت در جذب آهن می شود.بیشتر حیوانات می توانند ویتامین  C را از گلوگز تهیه می کنند، اما انسان نمی تواند، بنابراین این ویتامین را به یک ویتامین ضروری تبدیل می کند، که باید از غذای خود دریافت کنید.'
        //     ],
        //     [
        //         'name' => 'ویتامین‌ب۱ (تیامین)',
        //         'description' => 'تیامین به بدن برای تولید انرژی کمک می کندو برای عملکرد سیستم عصبی مورد نیاز است.تیامین برای رشد، اشتها و هضم غذا لازم است'
        //     ],
        //     [
        //         'name' => 'ویتامین‌ب۲ (ریبوفلاوین)',
        //         'description' => 'ریبوفلاوین به بدن شما کمک می کند از انرژی دریافتی از کربوهیدراتها، چربی ها و پروتئین ها استفاده کنید.ریبوفلاوین همچنین در دفاع از سلولهای شما در برابر رادیکالهای آزاد نقش دارد.رادیکالهای آزاد هنگامی ساخته می شوند که سلولهای شما از اکسیژن استفاده می کنند و در صورت عدم کنترل، باعث آسیب می شوند.'
        //     ],
        //     [
        //         'name' => 'ویتامین‌ب۳ (نیاسین)',
        //         'description' => 'نیاسین به بدن شما کمک می کند تا کربوهیدراتها، چربی ها، پروتئین ها و کتونهارا تجزیه کند.در ساخت اسیدهای چرب نیز از نیاسین استفاده می شود.نیاسین را می توان از اسید آمینه تریپتوفان نیز تهیه کرد.بنابراین، برخی از تریپتوفانهای موجود در غذاهایی که میخورید در هدف نیاسین شما شمرده می شود.'
        //     ],
        //     [
        //         'name' => 'ویتامین‌ب۵ (پانتوتنیک اسید)',
        //         'description' => 'ویتامین B5 برای تولید انرژی از کربوهیدراتها، چربی ها، پروتئینها و کتونها مورد نیاز است.یرای تولید چربی های جدید و تجزیه آنها لازم است. B5 برای ساخت برخی هورمونها مانند: ملاتونین، هورمونی که در چرخه خواب و بیداری شما دخیل است، استفاده می شود.'
        //     ],
        //     [
        //         "name" => "ویتامین‌ب۶",
        //         "description" => "ویتامین B6 که پیریدوکسین، پیریدوکسامین یا پیریدوکسال نیز نامیده می شود، برای ساخت اسیدهای آمینه و تجزیه آنها استفاده می شود. برای ساختن نیاسین ( ویتامین B3) از اسید آمینه تریپتوفان لازم است.B6 در هنگام نیاز به انرژی، به ذخیره سازی فرم گلوگز کمک می کند. نقش مهمی در سلامت مغز دارد و از سلولهای عصبی محافظت می کند. و انتقال دهنده های عصبی مانند سروتونین ایجاد می کند."
        //     ],
        //     [
        //         "name" => "ویتامین‌ب۴ (کولین)",
        //         'description' => ''
        //     ],
        //     [
        //         "name" => "ویتامین K",
        //         "description" => "ویتامین K  برای لخته شدن خون و استخوان سازی لازم است. ویتامین Kمی تواند توسط باکتریهای روده ساخته شود و به برخی از نیازهای روزانه شما کمک می کند."
        //     ],
        //     [
        //         "name" => "ویتامین‌ب9 (فولات)",
        //         "description" => "فولات که بعضا ویتامین B9 یا فولاسین نامیده می شود، در ساختن DNA در سلولهای جدید مورد نیاز است.این امر در بدن شما که سلولهای جدید دائما در حال ساخت هستند، مانند سلولهای سفید خون در سیستم ایمنی بدن که برای مقابله با عفونتها استفاده می شود، بیشتر مشهود است.  به همین دلیل در طول رشد و بارداری به فولات بیشتری نیاز است.فولات برای ساختن گلبولهای قرمز خون که اکسیژن را به سلولهای شما می رسانند،استفاده می شود.فرم مکمل فولات، به نام اسید فولیک، نسبت به فولات موجود در غذاها آسانتر است.اسید فولیک فقط در مکملها و غذاهای غنی شده وجود خواهد داشت."
        //     ],
        //     [
        //         "name" => "پروتئین",
        //         "description" => "پروتئین ها از اسیدهای آمینه به هم پیوسته ساخته می شوند تا زنجیره ای ایجاد کنند.شما به پروتئین کل کافی برای جایگزینی پروتئین هایی که هر روز تجزیه می شوند، نیاز دارید و همچنین باید اسیدهای آمینه ضروری را  در طول روز نگه دارید تا پروتئین ساخته شده ساخته شوند.پروتئین ها ساختار بدن، پوست، عضلات و کلاژن را فراهم می کنند.همه آنزیمها پروتئین هستند.آنزیم ها برای هضم غذا و واکنش های متابولیکی در سلول ها مورد نیاز هستند.پروتئین ها هورمون هایی هستند که مانند انسولین از یک اندام به بدن دیگر سیگنال می فرستند.پروتئین ها سیستم ایمنی بدن شما را تشکیل می دهند.آنتی بادی های شما پروتئین هستند.همچنین می توانید پروتئین ها را برای انرژی متابولیزه کنید."
        //     ],
        //     [
        //         "name" => "کلسیم",
        //         "description" => "کلسیم فراوانترین ماده معدنی در بدن شما است.کلسیم به رشد استخوان های سالم در اوایل زندگی کمک می کند. و از دست دادن استخوان در اواخر عمر، خود را به حداقل می رساند.کلسیم هنگام انقباض عضلات، لخته شدن خون و ارسال سیگنال از مغز به بافتهای بدن استفاده می شود.مصرف بیش از حد منیزیم می تواند جذب کلسیم کند.تعادل کلسیم-منیزیم را در دفتر خاطرات خود بررسی کنید. تا ببینید که آیا مواد مغذی را به صورت متعادل می خورید یا نه."
        //     ],
        //     [
        //         "name" => "آهن",
        //         "description" => "از آهن برای تولید انرژی استفاده می شود. همچنین برای ساخت اسیدهای آمینه، کلاژن، هورمونها و انتقال دهنده های عصبی استفاده می شود.برای ساخت هموگلوبین و میوگلوبین که به ترتیب برای نگهداری اکسیژن در گلبولهای قرمز و عضلات استفاده می شود، آهن مورد نیاز است.جذب آهن از منابع حیوانی آسانتر از منابع گیاهی است.حدود 10 درصد آهن در رژیم وگان جذب می شود.در حالی که در رژیم غذایی ترکیبی 20 درصد آهن است."
        //     ],
        //     [
        //         "name" => "منیزیم",
        //         "description" => "منیزیم نقش های زیادی دارد، از جمله آزاد سازی انرژی از چربی ها و کربوهیدراتها، انقباض عضلات، ارسال اطلاعات به مغز از طریق تکانه های عصبی، سلامت استخوان و لخته شدن خون.بیش از نیمی از منیزیم در بدن شما در استخوانها یافت می شود. مصرف بیش از حد کلسیم یا فسفر می تواند جذب منیزیم را محدود کند.تعادل مواد مغذی کلسیم-منیزیم را در دفتر خاطرات خود بررسی کنید تا ببینید آیا این مواد مغذی را متعادل دریافت می کنید یا نه؟"
        //     ],
        //     [
        //         "name" => "فسفر",
        //         "description" => "فسفر با کلسیم کار می کند تا ساختار استخوانها و دندانهای شما را فراهم کند.به حفظ تعادل مایعات و همچنین تعادل اسید/باز در بدن کمک می کند.فسفر در DNA و غشاهای سلولی یافت می شود.بنابراین برای رشد و جایگزینی سلولها و بافتها مورد نیاز است."
        //     ],
        //     [
        //         "name" => "نمک(سدیم)",
        //         "description" => "سدیم با پتاسیم کار می کند تا تعادل مایعات و الکترولیتها را حفظ کند. سدیم به انتقال سایر مواد مغذی به داخل سلول، انقباض عضلات و ارسال سیگنال از طریق اعصاب کمک می کند.حدود 10 درصد سدیم در رژیم غذایی شما بطور طبیعی در غذاهایی که می خورید وجود دارد، حدود 15 درصد از خواکیهای روی میز اضافه می شود و بقیه 75 درصد از غذاهای فرآوری شده تامین می گردد."
        //     ],
        //     [
        //         "name" => "روی",
        //         "description" => "روی در بیش از 200 پروتئین که عملکردهای مختلفی دارند مانند ایمنی، ترمیم زخم، درک چشایی، تولید فرم فعال ویتامین A و دفاع در برابر رادیکالهای آزاد استفاده می شود. مصرف روی بالاتر از UL می تواند در جذب مس اختلال ایجاد کند( از آنجا که این مواد مغذی برای همان محل جذب رقابت می کنند.) و بطور بالقوه منجر به کمبود مس می شود. روی : تعادل مواد مغذی مس را بررسی کنید تا ببینید آیا این مواد مغذی را متعادل میکنید یا خیر؟"
        //     ],
        //     [
        //         "name" => "مس",
        //         "description" => "از مس برای ساخت سلولهایی در سیستم ایمنی بدن شما استفاده می شود. که با عفونت ها مقابله می کنند. و از بدن در برابر رادیکالهای آزاد محافظت می کند.همچنین برای ساخت کلاژن در پوست، استخوانها و غضروف های شما استفاده می شود.مس برای ساختن هموگلوبین، مولکولی که اکسیژن را در سلولهای قرمز خون منتقل می کند، مورد نیاز است."
        //     ],
        //     [
        //         "name" => "منگنز",
        //         "description" => "منگنز به فرم استخوانها و همچنین بافت همبند مانند غضروف کمک می کند.منگنز در متابولیسم مواد مغذی درشت، کربوهیدرات ها، چربی ها و پروتئین ها نقش دارد.منگنز به بدن شما کمک می کند تا رادیکالهای آزاد بدن را سم زدایی کنند."
        //     ],
        //     [
        //         "name" => "سلنیوم",
        //         "description" => "سلنیوم در سیستم دفاعی آنتی اکسیدانی شما نقش دارد تا از آسیب به سلولهای شما جلوگیری کند.این ماده به تولید هورمونهای تیروئید کمک می کند که به تنظیم رشد، دمای بدن و میزان متابولیسم کمک می کند.سلنیوم در پروتئین گنجانده شده و در پروتئین موجود در غذای شما یافت می شود."
        //     ],
        //     [
        //         "name" => "کافئین",
        //         "description" => "کافئین محرکی است که باعث می شود کمتر احساس خستگی و تمرکز کنید.کافئین همچنین ممکن است احساس عصبی یا اضطرابی ایجاد کند و خواب شما را مختل کند."
        //     ],
        //     [
        //         "name" => "چربی ها",
        //         "description" => "چربی ها که به آنها لیپید نیز گفته می شود، خانواده ای از ترکیبات هستند که زنجیره های طولانی هیدروژن و کربن هستند و در آب محلول نیستند.آنها منبع متراکم انرژی (9کیلوگرم در گرم) هستند.شما ظرفیت نامحدودی برای ذخیره انرژی به صورت چربی دارید.با عملکرد شبیه به یک بالش از اندامهای شما محافظت می کند و بدن را در برابر درجه حرارت شدید عایق می کند.چربی پوست، چشم و ریه های شما را روان می کند.آنها همچنین برای ساخت غشای سلولی، برای سیگنال دهی بین سلولها و ساخت هورمون استفاده می شوند.برای جذب ویتامین های محلول در چربی، در رژیم غذایی خود نیاز به چربی و همچنین به ویتامین های A,D,E و K نیاز دارید."
        //     ],
        //     [
        //         "name" => "کلسترول",
        //         "description" => "کلسترول نوعی چربی است که برای هضم و جذب چربی ها و ویتامین های محلول در چربی در غذای شما استفاده می شود.همچنین در غشای سلولی، تعیین اینکه چه چیزی به داخل سلول خارج می شود و نحوه تعامل سلولها با یکدیگر مهم است.کلسترول همچنین برای ساختن هورمونهای استرول در بدن شما استفاده می شود، مانند هورمون های جنسی استروژن و تستوسترون.بدن شما می تواند کلسترول کافی برای تامین نیازهای شما ایجاد کند، بنابراین کلسترول یک ماده مغذی ضروری نیست.وقتی کلسترول را در غذاها می خورید، بدن برای جبران کم می کند."
        //     ],
        //     [
        //         "name" => "اسیدهای چرب ترانس",
        //         "description" => "چربی های ترانس چربی هایی هستند که پیوندهای دوتایی شکل آنها متفاوت از اکثر چربی های  غیر اشباع تک و چند منظوره است.چربی های ترانس ساخته شده بطور طبیعی در معده حیوانات نشخوار کننده (مانند گاو و گوسفند) و این چربی های ترانس برای خوردن بی خطر هستند.چربی های ترانس همچنین هنگام از بین بردن پیوندهای دوگانه از چربی های اشباع نشده چند منظوره ساخته می شوند تا ثبات بیشتری داشته باشند.این چربی های ترانس با افزایش خطر بیماری های قلبی عروقی مرتبط هستند."
        //     ],
        //     [
        //         "name" => "اسیدهای چرب اشباع",
        //         "description" => "چربی های اشباع شده هیچ پیوند دوگانه ای در زنجیر ندارند و باعث می شوند در دمای اتاق جامد شوند. بدن شما می تواند چربی های اشباع شده تولید کند."
        //     ],
        //     [
        //         "name" => "چربی اشباع نشده چندگانه",
        //         "description" => "چربی های اشباع نشده پلی حاوی پیوندهای دوگانه (پلی اتیلن) دوتایی زیادی در زنجیره هستند.آنها معمولا در دمای اتاق مایع هستند.هر پیوند دوتایی باعث می شود یک چربی اشباع نشده چند برابر در معرض اکسیداسیون قرار بگیرد."
        //     ],
        //     [
        //         "name" => "کربوهیدرات",
        //         "description" => "کربوهیدراتها، قندها ، نشاسته و فیبرهای موجود در غذاها هستند.نشاسته و قندها انرژی را تامین می کنند و فیبرها بیستر از سیستم هضم، هضم نمی شوند."
        //     ],
        //     [
        //         "name" => "فیبر",
        //         'description' => ''
        //     ],
        //     [
        //         "name" => "ویتامین B12، اضافه شده",
        //         'description' => ''
        //     ],
        //     [
        //         "name" => "قند",
        //         "description" => "قندها کربوهیداراتهایی هستندکه طعم شیرینی دارند.این دسته شامل قندها و قندهای موجود در طبیعت است که به غذاها اضافه می شوند. "
        //     ],
        // ];
        $nutrients = [
            ['name' => 'انرژی'],
            ['name' => 'کربوهیدرات'],
            ['name' => 'پروتئین'],
            ['name' => 'چربی'],
            ['name' => 'آب'],
            ['name' => 'فیبر'],
            ['name' => 'قند'],
            ['name' => 'کلسترول'],
            ['name' => 'ویتامین A'],
            ['name' => 'ویتامین D'],
            ['name' => 'ویتامین E'],
            ['name' => 'ویتامین K'],
            ['name' => 'ویتامین C'],
            ['name' => 'تیامین (B1)'],
            ['name' => 'ریبوفلاوین (B2)'],
            ['name' => 'نیاسین (B3)'],
            ['name' => 'کولین (B4)'],
            ['name' => 'پانتوتنیک اسید (B5)'],
            ['name' => 'ویتامین B6'],
            ['name' => 'فولات (B9)'],
            ['name' => 'ویتامین B12'],
            ['name' => 'کلسیم'],
            ['name' => 'آهن'],
            ['name' => 'منیزیم'],
            ['name' => 'فسفر'],
            ['name' => 'پتاسیم'],
            ['name' => 'سدیم (نمک)'],
            ['name' => 'روی'],
            ['name' => 'مس'],
            ['name' => 'منگنز'],
            ['name' => 'سلنیم'],
        ];

        foreach($nutrients as $nutrient) {
            Nutrient::create($nutrient);
        }
    }
}
