@extends('_master')
@section('meta')

    <link rel="canonical" href="{{ route('about') }}" />
    <meta name="description"
        content="تام یک، فروشگاهی اینترنتی در زمینه فروش آجیل، خشکبار و بسیاری از محصولات محلی ارگانیک و سالم محلی است.">
    <meta property="og:site_name" content="{{ Config('app.name') }}" />
    @component('components.schema-sitename')
    @endcomponent
@endsection
@section('title', 'درباره ما')
@section('content')
    <div class="container-xl">
        <div class="row">
            <h1 class="title mb-4">درباره ما</h1>
            <p class="text">
                تام یک، فروشگاهی اینترنتی در زمینه فروش آجیل، خشکبار و بسیاری از محصولات محلی ارگانیک و سالم است. که بهترین
                و مرغوب‌ترین محصول هر منطقه را برای شما مشتریان عزیز فراهم می‌کند.
            </p>
            <p class="text">
                هر محصول نمونه و باکیفیت، مختص یک منطقه هست و ما سعی می‌کنیم بهترین محصول هر منطقه را، در صورت سالم و مفید
                بودن، تهیه کنیم و آن را به دست شما مشتری عزیز برسانیم تا با خیالی راحت و آسوده، نوش‌جان بفرمایید.
            </p>
            <p class="text">
                ما در این مجموعه با رعایت کلیه نکات بهداشتی و اصول نگهداری مواد غذایی، محصولاتی عرضه می‌کنیم که کاملا
                بهداشتی، خوش‌مزه، بدون مواد نگهدارنده و با طعم و مزه اصلی است.
            </p>
            <p class="text">
                مهم‌ترین هدف ما این است که مشتری عزیز ما از کیفیت و قیمت محصولات تام یک اطمینان خاطر داشته باشد.
            </p>
            <p class="text">
                ما در اسرع وقت محصول سفارش داده شده را با پست پیشتاز برای شما ارسال می‌کنیم.
            </p>
            <p class="text">
                همچنین می‌توانید اپلیکیشن اندرویدی تام یک را از <a href="https://cafebazaar.ir/app/com.tamyek.app"
                    title="اپلیکیشن تام یک">کافه بازار</a> و <a href="https://myket.ir/app/com.tamyek.app"
                    title="اپلیکشن تام یک">مایکت</a> نصب کنید و به راحتی و در کم‌ترین زمان محصولات دلخواه خود را سفارش دهید.
            </p>
        </div>
    </div>
@endsection
