@extends('_master')
@section('title', 'قوانین و مقررات تام یک')
@section('meta')
    @component('components.schema-sitename')
    @endcomponent
@endsection
@section('content')
    <div class="container-xl">
        <div class="row">
            <p class="title mb-4">سیاست حفظ حریم خصوصی تام یک</p>
            <p class="text">با افزایش استفاده از اینترنت، حفظ حریم خصوصی و اطمینان از عدم سوء استفاده از اطلاعاتمان، به یکی
                از نگرانی‌های امروزه تبدیل شده است. سیاست ما در این زمینه دریافت حداقل اطلاعات است تا فقط بتوانیم محصول
                خریداری شده را به دست مشتری عزیزمان برسانیم. هنگام ورود به برنامه شماره تلفن همراه شما جهت ارسال کد تایید و
                بعدا هنگام خرید محصول جهت ارسال پیامک‌های اطلاع‌رسانی دریافت می‌گردد. نام و نام‌خانوادگی، نشانی محل سکونت و
                کدپستی هم هنگام خرید محصول، جهت ارسال کالا با پست دریافت می‌گردد. شماره تلفن ثابت و نشانی ایمیل اختیاری است.
                تام یک از اطلاعات شما به غیر از موارد مذکور هیچ استفاد‌ه‌ای نمی‌کند و تحت هیچ شرایطی آن را در اختیار هیچ شخص
                یا نهاد ثالثی قرار نمی‌دهد</p>
            <p class="title my-4">قوانین و مقررات تام یک</p>
            <p class="text">۱- پردازش و ارسال سفارشات فقط در روز‌های کاری امکان پذیر است</p>
            <p class="text">۲- در صورتی که از کالای سفارش داده شده موجود نباشد، تام یک می‌تواند مبلغ پرداختی کاربر را
                حداکثر تا 24ساعت کاری به حساب مشتری عودت نماید</p>
            <p class="text">۳- کاربران عزیز باید هنگام ثبت سفارش، اطلاعات درخواستی را به درستی و کامل وارد نمایند. در صورت
                نقص و یا نادرست بودن اطلاعات وارد شده و ارسال کالا به آدرس نادرست تام یک هیچ مسئولیتی نخواهد داشت</p>

        </div>
    </div>
@endsection
